#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-lambda-cost.data.archive_file.zip_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "zip_lambda"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/prepare.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "modules/aws-lambda-cost/prepare"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_lambda_function.aws-lambda-cost will be created
  + resource "aws_lambda_function" "aws-lambda-cost" {
      + arn                            = (known after apply)
      + filename                       = "modules/aws-lambda-cost/prepare.zip"
      + function_name                  = "aws-lambda-cost"
      + handler                        = "handler.main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 0
      + role                           = "arn:aws:iam::589845989135:role/iam_for_lambda"
      + runtime                        = "python3.6"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SLACK_CHANNEL_NAME" = "#aws"
              + "SLACK_WEBHOOK_URL"  = "https://hooks.slack.com/services/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"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.aws-lambda-cost.null_resource.main will be created
  + resource "null_resource" "main" {
      + id = (known after apply)
    }

  # module.aws-lambda-cost.template_dir.main will be created
  + resource "template_dir" "main" {
      + destination_dir = "modules/aws-lambda-cost/prepare"
      + id              = (known after apply)
      + source_dir      = "modules/aws-lambda-cost/src"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on modules/aws-lambda-cost/main.tf line 19, in data "archive_file" "zip_lambda":
  19:   depends_on  = ["template_dir.main"]

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.


Warning: Quoted references are deprecated

  on modules/aws-lambda-cost/main.tf line 45, in resource "aws_lambda_function" "aws-lambda-cost":
  45:   depends_on                     = ["data.archive_file.zip_lambda"]

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.


Warning: Interpolation-only expressions are deprecated

  on modules/aws-lambda-cost/main.tf line 47, in resource "aws_lambda_function" "aws-lambda-cost":
  47:   filename                       = "${data.archive_file.zip_lambda.output_path}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Warning: Interpolation-only expressions are deprecated

  on modules/aws-lambda-cost/main.tf line 48, in resource "aws_lambda_function" "aws-lambda-cost":
  48:   source_code_hash               = "${data.archive_file.zip_lambda.output_base64sha256}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Warning: Quoted references are deprecated

  on modules/aws-lambda-cost/main.tf line 65, in resource "null_resource" "main":
  65:   depends_on = ["aws_lambda_function.aws-lambda-cost"]

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
